src/cf/Catalogs/ор_ЛекарственныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_ЛекарственныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛатынь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛатыньПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_ЛекарственныеФормы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементКлассификатора(ПараметрыДанных) Экспорт
	
	РезультатВозврат = Новый Структура;
	РезультатВозврат.Вставить("ВсеЭлементы", Новый Соответствие);
	РезультатВозврат.Вставить("КоличествоНовыхЭлементов", 0);
	РезультатВозврат.Вставить("КоличествоОбновленныхЭлементов", 0);
	РезультатВозврат.Вставить("МассивНовыхЭлементов", Новый Массив);
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"           , Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ПоискПоНаименованию"       , Истина);
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюПодобно", Ложь);
	ПараметрыПолучения.Вставить("Дерево"                    , Новый ДеревоЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие"     , Ложь);
	
	Если ПараметрыДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыДанных);
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Количество() = 0 Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.Наименование КАК Наименование
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Наименование КАК Наименование,
	|	ЕСТЬNULL(Спр.Ссылка, ЗНАЧЕНИЕ(Справочник.ор_ЛекарственныеФормы.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_ЛекарственныеФормы КАК Спр
	|		ПО (&ПоискПоНаименованию
	|					И Таб.Наименование = Спр.Наименование
	|				ИЛИ &ПоискПоНаименованиюПодобно
	|					И Спр.Наименование ПОДОБНО ""%"" + Таб.Наименование + ""%"")");
	Запрос.УстановитьПараметр("Таблица"                   , ПараметрыПолучения.ТаблицаЗначений);
	Запрос.УстановитьПараметр("ПоискПоНаименованию"       , ПараметрыПолучения.ПоискПоНаименованию);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюПодобно", ПараметрыПолучения.ПоискПоНаименованиюПодобно);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответсвиеЭлементов = Новый Соответствие;
	НайденыВсеЭлементы = Истина;
	Пока Выборка.Следующий() Цикл
		СоответсвиеЭлементов.Вставить(Выборка.Наименование, Выборка.Ссылка);
		Если Выборка.Ссылка.Пустая() Тогда
			НайденыВсеЭлементы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
	
	ОбновлятьСуществующие = ПараметрыПолучения.ОбновлятьСуществующие;
	Если НайденыВсеЭлементы И НЕ ОбновлятьСуществующие Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	// Формирование структуры реквизитов справочника.
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Наименование");
	СтруктураДанных.Вставить("Родитель");
	
	Для Каждого Реквизит Из Метаданные.Справочники.ор_ЛекарственныеФормы.Реквизиты Цикл
		СтруктураДанных.Вставить(Реквизит.Имя);
		
		Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти(Реквизит.Имя) = Неопределено Тогда
			ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущийЭлемент Из РезультатВозврат.ВсеЭлементы Цикл
		
		СправочникСсылка = ТекущийЭлемент.Значение;
		Если НЕ СправочникСсылка.Пустая() И НЕ ОбновлятьСуществующие Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Наименование", ТекущийЭлемент.Ключ);
		НайденныеСтроки = ПараметрыПолучения.Дерево.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
		Иначе
			НайденныеСтроки = ПараметрыПолучения.ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СправочникСсылка.Пустая() Тогда
			СсылкаСправочника = СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие,
				РезультатВозврат
			);
			РезультатВозврат.ВсеЭлементы.Вставить(ТекущийЭлемент.Ключ, СсылкаСправочника);
			
			РезультатВозврат.МассивНовыхЭлементов.Добавить(СсылкаСправочника);
		Иначе
			СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие,
				РезультатВозврат);
			РезультатВозврат.КоличествоОбновленныхЭлементов = РезультатВозврат.КоличествоОбновленныхЭлементов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВозврат.КоличествоНовыхЭлементов = РезультатВозврат.МассивНовыхЭлементов.Количество();
	
	Возврат РезультатВозврат;
	
КонецФункции

Функция СоздатьЭлементСлужебный(Данные, СправочникСсылка, ОбновлятьСуществующие, РезультатВозврат)
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.ор_ЛекарственныеФормы.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Данные.Родитель <> Неопределено Тогда
		СписокИсключений = "НаименованиеЛатынь,НаименованиеЛатыньПолное";
	Иначе
		СписокИсключений = "";
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СправочникОбъект, Данные,, СписокИсключений);
	Если Данные.Родитель <> Неопределено Тогда
		СправочникОбъект.Родитель = Справочники.ор_ЛекарственныеФормы.НайтиПоНаименованию(Данные.Родитель.Наименование);
		
		ПустаяСсылка = СправочникОбъект.Родитель.Пустая();
		Если ПустаяСсылка ИЛИ ОбновлятьСуществующие Тогда
			СтруктураРодитель = Новый Структура;
			Для Каждого СвойствоСтруктуры Из Данные Цикл
				СтруктураРодитель.Вставить(СвойствоСтруктуры.Ключ);
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(СтруктураРодитель, Данные.Родитель);
			
			СправочникОбъект.Родитель = СоздатьЭлементСлужебный(
				СтруктураРодитель,
				СправочникОбъект.Родитель,
				ОбновлятьСуществующие,
				РезультатВозврат
			);
			Если ПустаяСсылка Тогда
				
				РезультатВозврат.ВсеЭлементы.Вставить(Данные.Родитель.Наименование, СправочникОбъект.Родитель);
				РезультатВозврат.МассивНовыхЭлементов.Добавить(СправочникОбъект.Родитель);
			Иначе
				РезультатВозврат.КоличествоОбновленныхЭлементов = РезультатВозврат.КоличествоОбновленныхЭлементов + 1;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		СправочникОбъект.Родитель = Справочники.ор_ЛекарственныеФормы.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		СправочникОбъект.Записать();
		_Возврат = СправочникОбъект.Ссылка;
	Исключение
		_Возврат = Справочники.ор_ЛекарственныеФормы.ПустаяСсылка();
	КонецПопытки;
	
	Возврат _Возврат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
